[
{
    "answer_1": "In react, controlled components are those components that are depended on their parents by mean of state, data, props, contexts. They do not possess their own data, if a data changes in the parenting component or controller components, controlled components are likely to change their visualization accordingly. Whereas, uncontrolled or independent components are opposite. The control and made or fetch their own data and the state management is totally under control of that component. uncontrolled component doesn't relay on their parents in case of state and props",
    "answer_2": "The props of the components can be validate, which make the code strongly typed props. In typescript, the fundament of writing code is strongly typed code. PropType allows to write props in strongly manner. In order to use PropType, dev must install it form npm. PropType supports more than 7 types: any, number, bool, string, object, array etc. when ever a props in produced, ParentComponent.propTypes = {propsName: PropTypes.string.isRequired} is written",
    "answer_3": "Node.js is the runtime of javascript build on the V8 engine of browser. because of this runtime, the most popular front-end language can be written in the server-side. Node.js allows developers to build api and server application on servers. On the other hand, express.js is a web application framework build on Node.js. This framework make life way easier than write raw Node commands. this application allows to write quick api. express offers router for the sake of modularity. robust api in express deals with requests in scalable servers.",
    "answer_4": "React custom hooks are functions that have unique and on demand functionality in the way of using normal hooks in react. custom hooks are reusable across the project, so no need to write same function over and over. custom hook also allows the dev to combine other hooks inside them. We should use custom hook for the sake of simplicity, saving time, write self describing code, avoid write same code to make the DRY(don't repeat yourself). custom hooks are easier to make and maintain."
}
]